Repository: villearo/va-references
Catalog: languages/va-references-*.po
Languages: fi

source: References
fi: Referenssit

source: Reference
fi: Referenssi

source: All References
fi: Kaikki referenssit

source: Add New Reference
fi: Uusi referenssi

source: Edit Reference
fi: Muokkaa referenssiä

source: View Reference
fi: Näytä referenssi

source: references
fi: referenssit

source: Reference Details
fi: Referenssin tiedot

source: Reference Link URL
fi: Referenssin linkin URL

source: Go to website
fi: Siirry sivustolle

source: VA References
fi: VA Referenssit
